#!/bin/sh

baseURL='http://flexberryJsonAPI.local/';

curl --request POST \ 
    $baseURL/Медведи \
    -H 'Content-Type: application/vnd.api+json' \
    -H 'Accept: application/vnd.api+json' \    
    -d "
{
    'data': {
        'type': 'Медведь',
        'id':3,
        'attributes': {
            'ПорядковыйНомер': 3,
            'Вес':65,
            'ЦветГлаз':'Зеленый',
            'Пол':'Мужской',
            'ДатаРождения':'2012/12/05'
        },
        'relationships': {
            'ЛесОбитания': {
                'data': { 'type': 'ЛесаОбитания', 'id': 'БеловежскаяПуща' }
            },
            'Папа': {
                'data': { 'type': 'Медведь', 'id': 1 }
            },
            'Мама': {
                'data': { 'type': 'Медведь', 'id': 2 }
            },
        },
        'included': [{
                'type':'ЛесаОбитания',
                'id':'БеловежскаяПуща',
                'attributes': {
                    'Название': 'Беловежская Пуща',
                    'Площадь': 222,
                    'Заповедник': false,
                    'ДатаПоследнегоОсмотра':'2010/05/05'
                },
                'links': {
                    'self': '$baseURL/ЛесаОбитания/БеловежскаяПуща'
                }
            }, {
                'type': 'Медведь',
                'id': 1,
                'attributes' : {
                    'ПорядковыйНомер': 1,
                    'Вес':102,
                    'ЦветГлаз':'Зеленый',
                    'Пол':'Мужской',
                    'ДатаРождения':'2010/12/05'
                    },
                'links': {
                    'self': '$baseURL/Медведи/1'
                }
            }, {
                'type': 'Медведь',
                'id': 2,
                'attributes' : {
                    'ПорядковыйНомер': 2,
                    'Вес':88,
                    'ЦветГлаз':'Карий',
                    'Пол':'Женский',
                    'ДатаРождения':'2011/01/15'
                    },
                'links': {
                    'self': '$baseURL/Медведи/2'
                }
            }
        ]
    }
}"